# Создать список и заполнить его элементами различных типов данных.
# Реализовать скрипт проверки типа данных каждого элемента.
# Использовать функцию type() для проверки типа. Элементы списка можно не запрашивать у пользователя,
# а указать явно, в программе.

my_list = [18, 'Tver', 25.8, None, 'Sister', 198, 1568.56, True]

for my_list in my_list:
    print(type(my_list))